Джира/src/Documents/Центр_Задача/Центр_Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Центр_Задача</name>
  <comment>Задачи сотрудников</comment>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗадачи</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>CatalogRef.Центр_ВидыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Центр_Партнеры</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.Центр_Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавнаяЗадача</name>
    <type>
      <types>DocumentRef.Центр_Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выполнен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Метки</name>
    <attributes>
      <name>Метка</name>
      <type>
        <types>CatalogRef.Центр_МеткиЗадач</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Джира/src/InformationRegisters/Центр_ОценкаЧасов/Центр_ОценкаЧасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Центр_ОценкаЧасов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>От</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>До</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Согласующий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Согласовант</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ТипОценки</name>
    <type>
      <types>EnumRef.Центр_ТипОценкиЧасов</types>
    </type>
  </resources>
  <attributes>
    <name>КомментарийОтказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОценки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.Центр_Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Джира/src/Enums/Центр_ЕдиницыИзмеренийВремени/Центр_ЕдиницыИзмеренийВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Центр_ЕдиницыИзмеренийВремени</name>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Час</name>
  </enumValues>
</mdclass:Enum>

Джира/src/Enums/Центр_ТипОценкиЧасов/Центр_ТипОценкиЧасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Центр_ТипОценкиЧасов</name>
  <enumValues>
    <name>Рамочная</name>
  </enumValues>
  <enumValues>
    <name>Точная</name>
  </enumValues>
  <enumValues>
    <name>ПоФакту</name>
  </enumValues>
</mdclass:Enum>

Джира/src/Documents/Центр_Задача/Forms/ФормаСозданияСогласованияОценкиЗадачи/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.Задача) Тогда
		Задача = Параметры.Задача;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Центр_ОценкаЧасовСрезПоследних.КомментарийОтказа
		|ИЗ
		|	РегистрСведений.Центр_ОценкаЧасов.СрезПоследних(, Задача = &Задача) КАК Центр_ОценкаЧасовСрезПоследних
		|ГДЕ
		|	Центр_ОценкаЧасовСрезПоследних.Отказ";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		КомментарийОтвет = Выборка.КомментарийОтказа;
	КонецЕсли;
	
	ЕдиницыИзмеренияДлительности = ПредопределенноеЗначение("Перечисление.Центр_ЕдиницыИзмеренийВремени.День");
	ЕдиницыИзмеренияЧасов = ПредопределенноеЗначение("Перечисление.Центр_ЕдиницыИзмеренийВремени.Час");
	ТипОценки = ПредопределенноеЗначение("Перечисление.Центр_ТипОценкиЧасов.Точная");
	ВидимостьОценкиЧасов();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ТипОценкиПриИзменении(Элемент)
	ВидимостьОценкиЧасов();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Отменить(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаСогласование(Команда)
	ОтправитьНаСогласованиеНаСервере();
	Закрыть();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 &НаСервере
 Процедура ВидимостьОценкиЧасов()
 	Если ТипОценки = ПредопределенноеЗначение("Перечисление.Центр_ТипОценкиЧасов.Точная") Тогда
 		Элементы.До.Заголовок = "Часы";
 		Элементы.От.Видимость = Ложь;
 		Элементы.До.Видимость = Истина;
 		Элементы.ЕдиницыИзмеренияЧасов.Видимость = Истина;
 	ИначеЕсли ТипОценки = ПредопределенноеЗначение("Перечисление.Центр_ТипОценкиЧасов.Рамочная") Тогда
 		Элементы.До.Заголовок = "До";
 		Элементы.От.Видимость = Истина;
 		Элементы.До.Видимость = Истина;
 		Элементы.ЕдиницыИзмеренияЧасов.Видимость = Истина;
 	Иначе
 		Элементы.От.Видимость = Ложь;
 		Элементы.До.Видимость = Ложь;
 		Элементы.ЕдиницыИзмеренияЧасов.Видимость = Ложь;
 	КонецЕсли;
 КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСогласованиеНаСервере()
	ДоВРегистр = 0;
	ОтВРегистр = 0;
	ДлительностьВРегистр = 0;
	
	ЧасовВДне = 8;
	ДнейВНеделе = 7;
	Если ЕдиницыИзмеренияДлительности = ПредопределенноеЗначение("Перечисление.Центр_ЕдиницыИзмеренийВремени.Неделя") Тогда
		ДлительностьВРегистр = Длительность * ДнейВНеделе;
	Иначе
		ДлительностьВРегистр = Длительность;
	КонецЕсли;
	
	Если ЕдиницыИзмеренияЧасов = ПредопределенноеЗначение("Перечисление.Центр_ЕдиницыИзмеренийВремени.День") Тогда
		ДоВРегистр = До * ЧасовВДне;
		ОтВРегистр = От * ЧасовВДне;
	Иначе
		ДоВРегистр = До;
		ОтВРегистр = От;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Центр_Задача.Постановщик,
		|	Центр_Задача.Постановщик ССЫЛКА Справочник.Центр_Партнеры КАК ЭтоПартнер,
		|	Центр_Задача.ГлавныйМенеджер
		|ИЗ
		|	Документ.Центр_Задача КАК Центр_Задача
		|ГДЕ
		|	Центр_Задача.Ссылка = &Задача";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Согласующий = Неопределено;
	Если Выборка.Следующий() Тогда
		Если Выборка.ЭтоПартнер Тогда
			Согласующий = Выборка.ГлавныйМенеджер;
		Иначе
			Согласующий = Выборка.Постановщик;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипОценки = ПредопределенноеЗначение("Перечисление.Центр_ТипОценкиЧасов.Точная") Тогда
 		РегистрыСведений.Центр_ОценкаЧасов.СоздатьЗаписьСогласования(Задача, ТипОценки, ДлительностьВРегистр,
 		КомментарийОценки, Согласующий, , ДоВРегистр);
 	ИначеЕсли ТипОценки = ПредопределенноеЗначение("Перечисление.Центр_ТипОценкиЧасов.Рамочная") Тогда
 		РегистрыСведений.Центр_ОценкаЧасов.СоздатьЗаписьСогласования(Задача, ТипОценки, ДлительностьВРегистр,
 		КомментарийОценки, Согласующий, ОтВРегистр, ДоВРегистр);
	Иначе		
 		РегистрыСведений.Центр_ОценкаЧасов.СоздатьЗаписьСогласования(Задача, ТипОценки, ДлительностьВРегистр,
 		КомментарийОценки, Согласующий);
 	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
